<a href="https://colab.research.google.com/github/seoin-cho/SOLUX_summer_data/blob/master/1%2C2%EC%A3%BC%EC%B0%A8_%ED%8C%AC%EB%8D%94%EC%8A%A4/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_7~14_(2020_07_30).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
friend_dict_list = [{'name':'John', 'age':15, 'job':'student'},
                {'name':'Jenny', 'age':30, 'job':'developer'},
                {'name':'Nate', 'age':30, 'job':'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df['salary'] = 0  #salary 열을 모두 0으로 만듦
df.head()

    name  age        job  salary
0   John   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [ ]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')  #student인지 아닌지에 따라 salary를 다르게 하는 방법 
df.head()

    name  age        job salary
0   John   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [ ]:
friend_dict_list = [{'name':'John', 'midterm':95, 'final':85},
                {'name':'Jenny', 'midterm':85, 'final':80},
                {'name':'Nate', 'midterm':30, 'final':10}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10

In [ ]:
df['total'] = df['midterm'] + df['final']  #두 column의 값을 합친 새로운 column을 만듦
df.head()

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [ ]:
df['average'] = df['total'] / 2  #두 column의 평균값 column을 만듦
df.head()

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [ ]:
grades = [] 
for row in df['average']:  #for문을 이용해 average 열의 모든 행에 접근  #if 조건문을 이용해 grades 리스트에 값을 append함
  if row >= 90:
    grades.append('A')
  elif row >= 80:
    grades.append('B')
  else:
    grades.append('F')

df['grade'] = grades
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [ ]:
def pass_or_fail(row):  #grade에 따라 p/f를 결정하는 함수
  if row != 'F':
    return "Pass"
  else:
    return "Fail"

In [ ]:
df.grade = df.grade.apply(pass_or_fail)  #.apply()를 이용해 해당 열에 함수를 적용
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [ ]:
date_list = [
             { 'yyyy-mm-dd':'2000-06-27'},
             {'yyyy-mm-dd':'2007-10-27'}
]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [ ]:
def extract_year(row):  #해당 열에서 원하는 문자만 추출하는 함수
  return row.split('-')[0]

In [ ]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)  #.apply()를 이용해 해당 열에 함수를 적용
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [ ]:
friend_dict_list = [{'name':'John', 'midterm':95, 'final':85},
                {'name':'Jenny', 'midterm':85, 'final':80},
                {'name':'Nate', 'midterm':30, 'final':10}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df.head()

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10

In [ ]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]],
    columns = ['name', 'midterm', 'final']
)
df2.head()

  name  midterm  final
0  Ben       50     50

In [ ]:
df.append(df2, ignore_index=True)  #df와 df2를 합침  #'ignore_index=True'를 이용해 index를 순차적으로 수정함

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50

In [ ]:
import pandas as pd
student_list = [
                {'name':'John', 'major':'ComputerScience', 'sex':'male'}, {'name':'Nate', 'major':'ComputerScience', 'sex':'male'}, {'name':'Abraham', 'major':'Physics', 'sex':'male'},
                {'name':'Brain', 'major':'Psychology', 'sex':'male'}, {'name':'Janny', 'major':'Economics', 'sex':'female'}, {'name':'Yuna', 'major':'Economics', 'sex':'female'},
                {'name':'Jeniffer', 'major':'ComputerScience', 'sex':'female'}, {'name':'Edward', 'major':'ComputerScience', 'sex':'male'}, {'name':'Zara', 'major':'Psychology', 'sex':'female'},
                {'name':'Wendy', 'major':'Economics', 'sex':'female'}, {'name':'Sara', 'major':'Psychology', 'sex':'female'}  ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name            major     sex
0       John  ComputerScience    male
1       Nate  ComputerScience    male
2    Abraham          Physics    male
3      Brain       Psychology    male
4      Janny        Economics  female
5       Yuna        Economics  female
6   Jeniffer  ComputerScience  female
7     Edward  ComputerScience    male
8       Zara       Psychology  female
9      Wendy        Economics  female
10      Sara       Psychology  female

In [ ]:
groupby_major = df.groupby('major')   #.groupby()  #()안의 콜럼을 기준으로 그룹을 나눔
groupby_major.groups

{'ComputerScience': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [ ]:
for name, group in groupby_major:
  print(name + ':'+ str(len(group)))
  print(group)
  print()

ComputerScience:4
       name            major     sex
0      John  ComputerScience    male
1      Nate  ComputerScience    male
6  Jeniffer  ComputerScience  female
7    Edward  ComputerScience    male

Economics:3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics:1
      name    major   sex
2  Abraham  Physics  male

Psychology:3
     name       major     sex
3   Brain  Psychology    male
8    Zara  Psychology  female
10   Sara  Psychology  female

In [ ]:
df_major_count = pd.DataFrame( { 'count':groupby_major.size()}).reset_index()  #.size()를 통해 각 그룹과 개체의 수를 나타냄  #reset_index()  #reset_index()를 통해 major 열이 index로 들어가는 것을 방지
df_major_count

             major  count
0  ComputerScience      4
1        Economics      3
2          Physics      1
3       Psychology      3

In [ ]:
groupby_sex = df.groupby('sex')
for name, group in groupby_sex:
  print(name + ': ' + str(len(group)))
  print(group)
  print()

female: 6
        name            major     sex
4      Janny        Economics  female
5       Yuna        Economics  female
6   Jeniffer  ComputerScience  female
8       Zara       Psychology  female
9      Wendy        Economics  female
10      Sara       Psychology  female

male: 5
      name            major   sex
0     John  ComputerScience  male
1     Nate  ComputerScience  male
2  Abraham          Physics  male
3    Brain       Psychology  male
7   Edward  ComputerScience  male

In [ ]:
df_sex_count = pd.DataFrame( {'count': groupby_sex.size()}).reset_index()
df_sex_count

      sex  count
0  female      6
1    male      5

In [ ]:
import pandas as pd
friend_list = [ 
               {'name':'John', 'major':'ComputerScience', 'sex':'male'},
               {'name':'Nate', 'major':'ComputerScience', 'sex':'male'},
               {'name':'Edward', 'major':'ComputerScience', 'sex':'male'},
               {'name':'Zara', 'major':'Psychology', 'sex':'female'},
               {'name':'John', 'major':'ComputerScience', 'sex':'male'}
]
df = pd.DataFrame(friend_list, columns = ['name', 'major', 'sex'])
df

     name            major     sex
0    John  ComputerScience    male
1    Nate  ComputerScience    male
2  Edward  ComputerScience    male
3    Zara       Psychology  female
4    John  ComputerScience    male

In [ ]:
df.duplicated()  #.duplicated()를 이용해 중복된 행을 찾음

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [ ]:
df.drop_duplicates()  #.drop_duplicates()를 이용해 중복된 행을 버림

     name            major     sex
0    John  ComputerScience    male
1    Nate  ComputerScience    male
2  Edward  ComputerScience    male
3    Zara       Psychology  female

In [ ]:
student_list = [
               {'name':'John', 'major':'ComputerScience', 'sex':'male'},
               {'name':'Nate', 'major':'ComputerScience', 'sex':'male'},
               {'name':'Edward', 'major':'ComputerScience', 'sex':'male'},
               {'name':'Zara', 'major':'Psychology', 'sex':'female'},
               {'name':'Wendy', 'major':'Economics', 'sex':'female'},
               {'name':'Nate', 'major':None, 'sex':'male'},
               {'name':'John', 'major':'Economics', 'sex':'male'},
                ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

     name            major     sex
0    John  ComputerScience    male
1    Nate  ComputerScience    male
2  Edward  ComputerScience    male
3    Zara       Psychology  female
4   Wendy        Economics  female
5    Nate             None    male
6    John        Economics    male

In [ ]:
df.duplicated()  #완벽하게 중복된 행이 없기 때문에 모두 False로 표시됨

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [ ]:
df.duplicated(['name'])  #name 열에서 중복된 행이 있는지 확인

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [ ]:
df.drop_duplicates(['name'], keep='first')  #name 열에서 중복된 행을 삭제  #첫번째 행을 살림

     name            major     sex
0    John  ComputerScience    male
1    Nate  ComputerScience    male
2  Edward  ComputerScience    male
3    Zara       Psychology  female
4   Wendy        Economics  female

In [ ]:
df.drop_duplicates(['name'], keep = 'last')  #뒤의 행을 살림

     name            major     sex
2  Edward  ComputerScience    male
3    Zara       Psychology  female
4   Wendy        Economics  female
5    Nate             None    male
6    John        Economics    male

In [ ]:
school_id_list = [
                  {'name':'John', 'job':'teacher', 'age':40}, {'name':'Nate', 'job':'teacher', 'age':35},
                  {'name':'Yuna', 'job':'teacher', 'age':37}, {'name':'Abraham', 'job':'student', 'age':10},
                  {'name':'Brain', 'job':'student', 'age':12}, {'name':'Janny', 'job':'student', 'age':11},
                  {'name':'Nate', 'job':'teacher', 'age':None}, {'name':'John', 'job':'student', 'age':None}
]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brain  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [ ]:
df.shape  #.shape를 이용해 데이터프레임의 행,열 갯수를 확인

(8, 3)

In [ ]:
import pandas as pd
school_id_list = [
                  {'name':'John', 'job':'teacher', 'age':40}, {'name':'Nate', 'job':'teacher', 'age':35},
                  {'name':'Yuna', 'job':'teacher', 'age':37}, {'name':'Abraham', 'job':'student', 'age':10},
                  {'name':'Brain', 'job':'student', 'age':12}, {'name':'Janny', 'job':'student', 'age':11},
                  {'name':'Nate', 'job':'teacher', 'age':None}, {'name':'John', 'job':'student', 'age':None}
]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brain  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [ ]:
df.isna()  #NaN인 원소를 확인

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [ ]:
df.isnull()  #NaN인 원소를 확인

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [ ]:
df.age = df.age.fillna(0)  #.fillna()를 이용해 NaN자리에 ()안의 숫자를 채워넣음   #age 열에서 NaN인 원소를 0으로 채움
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brain  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [ ]:
school_id_list = [
                  {'name':'John', 'job':'teacher', 'age':40}, {'name':'Nate', 'job':'teacher', 'age':35},
                  {'name':'Yuna', 'job':'teacher', 'age':37}, {'name':'Abraham', 'job':'student', 'age':10},
                  {'name':'Brain', 'job':'student', 'age':12}, {'name':'Janny', 'job':'student', 'age':11},
                  {'name':'Nate', 'job':'teacher', 'age':None}, {'name':'John', 'job':'student', 'age':None}
]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brain  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [ ]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace=True)  #job으로 그룹을 나누고 각 job 그룹의 age median 값을 NaN 자리에 대입
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brain  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

In [ ]:
import pandas as pd
date_list = [
             {'yyyy-mm-dd':'2000-06-27'},
             {'yyyy-mm-dd':'2002-09-24'},
             {'yyyy-mm-dd':'2005-12-20'}
]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [ ]:
def extract_year(column):
  return column.split('-')[0]

df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [ ]:
#특정 열을 이용해 다른 열을 생성하는 예시1
def get_age(year, current_year):
  return current_year - int(year)

df['age'] = df['year'].apply(get_age, current_year=2020)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   20
1  2002-09-24  2002   18
2  2005-12-20  2005   15

In [ ]:
#특정 열을 이용해 다른 열을 생성하는 예시2
def get_introduce(age, prefix, suffix):
  return prefix+str(age)+suffix

df['introduce'] = df['age'].apply(get_introduce, prefix="I am ", suffix=' years old')
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   20  I am 20 years old
1  2002-09-24  2002   18  I am 18 years old
2  2005-12-20  2005   15  I am 15 years old

In [ ]:
#두 가지 이상의 열을 이용해 새로운 열을 생성하는 방법
def get_introduce_2(row):
  return "I was born in "+str(row.year)+" my age is "+str(row.age)

df.introduce = df.apply(get_introduce2, axis= 1)  #df 자체에 함수를 apply  #axis=1을 통해 row의 모든 열을 활용할 수 있도록 한다.
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   20  I was born in 2000 my age is 20
1  2002-09-24  2002   18  I was born in 2002 my age is 18
2  2005-12-20  2005   15  I was born in 2005 my age is 15

In [ ]:
def get_introduce(age, prefix, suffix):
  return prefix+str(age)+suffix

df['introduce'] = df['age'].apply(get_introduce, prefix="I am ", suffix=' years old')


def get_introduce_2(row):
  return "I was born in "+str(row.year)+" my age is "+str(row.age)

df['introduce2'] = df.apply(get_introduce_2, axis=1)
df

   yyyy-mm-dd  year  age          introduce                       introduce2
0  2000-06-27  2000   20  I am 20 years old  I was born in 2000 my age is 20
1  2002-09-24  2002   18  I am 18 years old  I was born in 2002 my age is 18
2  2005-12-20  2005   15  I am 15 years old  I was born in 2005 my age is 15

In [ ]:
import pandas as pd
date_list = [
             {'date':'2000-06-27'},
             {'date':'2002-09-24'},
             {'date':'2005-12-20'}
]
df = pd.DataFrame(date_list, columns = ['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [ ]:
def extract_year(date):
  return date.split('-')[0]

In [ ]:
df['year'] = df['date'].map(extract_year)
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [ ]:
job_list = [
            {'age':20, 'job':'student'},
            {'age':30, 'job':'developer'},
            {'age':30, 'job':'teacher'}
]
df = pd.DataFrame(job_list, columns = ['age', 'job'])
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [ ]:
df.job = df.job.map({'student':1, 'developer':2, 'teacher':3})  #map을 이용해 딕셔너리 value로 바꿈
df

   age  job
0   20    1
1   30    2
2   30    3

In [ ]:
x_y = [
       {'x':5.5 ,'y':-5.6 ,'z':-1.1},
       {'x':-5.2 ,'y':5.5 ,'z':-2.2 },
       {'x':-1.6 ,'y':-4.5 ,'z':-3.3 }
]
df = pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [ ]:
import numpy as np
df = df.applymap(np.around)  #데이터프레임 내 모든 원소에 적용하는 경우 applymap 함수 사용
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

In [ ]:
import pandas as pd
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [ ]:
df.job.unique()  #job열의 모든 원소를 나타냄

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [ ]:
df.job.value_counts()  #서로 다른 job과 그 개체 수를 확인

teacher              8
student              5
banker               2
lawyer               2
developer            1
basketball player    1
dentist              1
Name: job, dtype: int64

In [ ]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [ ]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [ ]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [ ]:
result = pd.concat([df1, df2])  #concat을 이용해 두 데이터프레임 합치기  #행으로 합치기
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [ ]:
result = pd.concat([df1, df2], ignore_index=True)  #'ignore_index=True'를 이용해 index를 순차적으로 수정함
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [ ]:
result = df1.append(df2, ignore_index = True)  #append 함수를 이용해 두 데이터프레임 합치기  #행으로 합치기
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [ ]:
l3 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l4 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]
         
df1 = pd.DataFrame(l3, columns = ['name', 'job'])
df2 = pd.DataFrame(l4, columns = ['age', 'country'])

In [ ]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [ ]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [ ]:
result = pd.concat([df1, df2], axis=1, ignore_index=True)  #concat을 이용해 두 데이터프레임 합치기  #'axis=1'을 이용해 열로 합치기
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

In [ ]:
result = pd.concat([df1,df2], axis=1)
result

   name        job  age country
0  John    teacher   25     U.S
1  Nate    student   30     U.K
2  Jack  developer   45   Korea

In [ ]:
#두 리스트 값을 보기 쉽게 비교하는 방법
label = [1,2,3,4,5]
prediction= [1,2,2,4,4]
comparison = pd.DataFrame({'label':label, 'prediction':prediction})
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4